app/views/holidays/_form.html.erb

    <%= f.label :Cidade %>
    <%= f.select 'city_id', options_for_select(City.all.collect{ |u| [u.name, u.id] }) %>
---
SELECT "cities".* FROM "cities"