app/views/holidays/index.html.erb

SELECT "cities".* FROM "cities"
---
          <div>
            <%= select_tag 'city_id', options_for_select(City.all.collect{ |u| [u.name, u.id] }), :onchange => 'on_change_city()' %>