app/views/usfs/_form.html.erb

    <div>
      <%= f.select 'city_id', options_for_select(City.all.collect{ |u| [u.name, u.id] }) %>
---
SELECT "cities".* FROM "cities"