app/views/professionals/_form.html.erb

SELECT "professional_types".* FROM "professional_types"
---
    <div>
      <%= f.select 'professionalType_id', options_for_select(ProfessionalType.all.collect{ |u| [u.name, u.id] }) %>

SELECT "specialties".* FROM "specialties"
---
    <div>
      <%= f.select 'specialty_id', options_for_select(Specialty.all.collect{ |u| [u.name, u.id] }) %>

SELECT "micro_areas".* FROM "micro_areas"
---
    <div>
      <%= f.select 'microArea_id', options_for_select(MicroArea.all.collect{ |u| [u.name, u.id] }) %>