app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "created_at", "updated_at", "cnpj") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Olinda"], ["created_at", "2017-11-10 01:36:20.145177"], ["updated_at", "2017-11-10 01:36:20.145177"], ["cnpj", "111.111.111./1111.11"]]

  def update
    respond_to do |format|
      if @city.update(city_params)
---
UPDATE "cities" SET "cnpj" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["cnpj", "97.655.026/0001-00"], ["updated_at", "2017-11-01 00:56:58.790956"], ["id", 1]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 1]]

    def set_city
      @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]