app/controllers/holidays_controller.rb

  def index
    @holidays = Holiday.all
---
SELECT "holidays".* FROM "holidays"

  def create
    @holiday = Holiday.new(holiday_params)

    respond_to do |format|
      if @holiday.save
---
INSERT INTO "holidays" ("date", "city_id", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)  [["date", "2017-10-15"], ["city_id", 9], ["created_at", "2017-10-15 14:30:39.028463"], ["updated_at", "2017-10-15 14:30:39.028463"], ["name", "teste"]]

  def destroy
    @holiday.destroy
---
DELETE FROM "holidays" WHERE "holidays"."id" = ?  [["id", 1]]

    def set_holiday
      @holiday = Holiday.find(params[:id])
---
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]