app/controllers/micro_areas_controller.rb

  def index
    @micro_areas = MicroArea.all
---
SELECT "micro_areas".* FROM "micro_areas"

  def create
    @micro_area = MicroArea.new(micro_area_params)

    respond_to do |format|
      if @micro_area.save
---
INSERT INTO "micro_areas" ("name", "usf_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", 0], ["usf_id", 1], ["created_at", "2017-11-01 02:16:14.700187"], ["updated_at", "2017-11-01 02:16:14.700187"]]

  def update
    respond_to do |format|
      if @micro_area.update(micro_area_params)
---
UPDATE "micro_areas" SET "name" = ?, "updated_at" = ? WHERE "micro_areas"."id" = ?  [["name", 1], ["updated_at", "2017-11-01 02:48:40.080267"], ["id", 2]]

  def destroy
    @micro_area.destroy
---
DELETE FROM "micro_areas" WHERE "micro_areas"."id" = ?  [["id", 1]]

    def set_micro_area
      @micro_area = MicroArea.find(params[:id])
---
SELECT  "micro_areas".* FROM "micro_areas" WHERE "micro_areas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]