app/controllers/professional_types_controller.rb

  def index
    @professional_types = ProfessionalType.all
---
SELECT "professional_types".* FROM "professional_types"

  def create
    @professional_type = ProfessionalType.new(professional_type_params)

    respond_to do |format|
      if @professional_type.save
---
INSERT INTO "professional_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Médico"], ["created_at", "2017-10-29 22:27:31.545502"], ["updated_at", "2017-10-29 22:27:31.545502"]]

  def update
    respond_to do |format|
      if @professional_type.update(professional_type_params)
---
UPDATE "professional_types" SET "name" = ?, "updated_at" = ? WHERE "professional_types"."id" = ?  [["name", "gentes Comunitários"], ["updated_at", "2017-10-29 22:30:53.242962"], ["id", 2]]

  def destroy
    @professional_type.destroy
---
DELETE FROM "professional_types" WHERE "professional_types"."id" = ?  [["id", 4]]

    def set_professional_type
      @professional_type = ProfessionalType.find(params[:id])
---
SELECT  "professional_types".* FROM "professional_types" WHERE "professional_types"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]