app/controllers/professionals_controller.rb

  def index
    @professionals = Professional.all
---
SELECT "professionals".* FROM "professionals"

  def create
    @professional = Professional.new(professional_params)

    respond_to do |format|
      if @professional.save
---
INSERT INTO "professionals" ("nome", "professionalType_id", "crm", "specialty_id", "coren", "matricula", "microArea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @professional.update(professional_params)
---
UPDATE "professionals" SET "nome" = ?, "updated_at" = ? WHERE "professionals"."id" = ?  [["nome", "testee"], ["updated_at", "2017-11-07 01:28:05.910864"], ["id", 2]]

  def destroy
    @professional.destroy
---
DELETE FROM "professionals" WHERE "professionals"."id" = ?  [["id", 2]]

    def set_professional
      @professional = Professional.find(params[:id])
---
SELECT  "professionals".* FROM "professionals" WHERE "professionals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]