app/controllers/specialties_controller.rb

SELECT "specialties".* FROM "specialties"
---
  def index
    @specialties = Specialty.all

INSERT INTO "specialties" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "teste"], ["created_at", "2017-11-01 03:39:34.193573"], ["updated_at", "2017-11-01 03:39:34.193573"]]
---
  def create
    @specialty = Specialty.new(specialty_params)

    respond_to do |format|
      if @specialty.save

UPDATE "specialties" SET "name" = ?, "updated_at" = ? WHERE "specialties"."id" = ?  [["name", "teste 3"], ["updated_at", "2017-11-01 03:44:49.168853"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @specialty.update(specialty_params)

DELETE FROM "specialties" WHERE "specialties"."id" = ?  [["id", 2]]
---
  def destroy
    @specialty.destroy

SELECT  "specialties".* FROM "specialties" WHERE "specialties"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_specialty
      @specialty = Specialty.find(params[:id])