app/controllers/usfs_controller.rb

  def index
    @usfs = Usf.all
---
SELECT "usfs".* FROM "usfs"

  def create
    @usf = Usf.new(usf_params)

    respond_to do |format|
      if @usf.save
---
INSERT INTO "usfs" ("nome", "nome_fantasia", "cnpj", "telefone", "bairro", "cep", "logradouro", "numero", "complemento", "ponto_de_referencia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usf.update(usf_params)
---
UPDATE "usfs" SET "ponto_de_referencia" = ?, "updated_at" = ? WHERE "usfs"."id" = ?  [["ponto_de_referencia", "Perto do mercadinho Tavares II"], ["updated_at", "2017-10-29 23:47:40.079019"], ["id", 1]]

  def destroy
    @usf.destroy
---
DELETE FROM "usfs" WHERE "usfs"."id" = ?  [["id", 2]]

    def set_usf
      @usf = Usf.find(params[:id])
---
SELECT  "usfs".* FROM "usfs" WHERE "usfs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]