app/views/micro_areas/_form.html.erb

SELECT "usfs".* FROM "usfs"
---
    <div>
      <%= f.select 'usf_id', options_for_select(Usf.all.collect{ |u| [u.nome, u.id] }) %>